In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Create students DataFrame
students = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'class_id': [101, 102, 103, None]  # None represents NULL in Python
})

# Create classes DataFrame
classes = pd.DataFrame({
    'class_id': [101, 102, 104],
    'class_name': ['Math', 'Science', 'History']
})

# Display the DataFrames
# print("Students:")
# print(students)
# print("\nClasses:")
# print(classes)

Students:
   id     name  class_id
0   1    Alice     101.0
1   2      Bob     102.0
2   3  Charlie     103.0
3   4    David       NaN

Classes:
   class_id class_name
0       101       Math
1       102    Science
2       104    History

In [3]:
students

   id     name  class_id
0   1    Alice     101.0
1   2      Bob     102.0
2   3  Charlie     103.0
3   4    David       NaN

In [4]:
classes

   class_id class_name
0       101       Math
1       102    Science
2       104    History

In [28]:
inner_join = pd.merge(students[['name', 'class_id']], 
                     classes, 
                     on='class_id', 
                     how='outer')
print("INNER JOIN:")
print(inner_join)

INNER JOIN:
      name  class_id class_name
0    Alice     101.0       Math
1      Bob     102.0    Science
2  Charlie     103.0        NaN
3      NaN     104.0    History
4    David       NaN        NaN

In [29]:
inner_join

      name  class_id class_name
0    Alice     101.0       Math
1      Bob     102.0    Science
2  Charlie     103.0        NaN
3      NaN     104.0    History
4    David       NaN        NaN